Revit 2026 API

# PrintParametersPaperPlacement Property

---

The paper placement type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PaperPlacementType PaperPlacement { get; set; }
```
```vb
Public Property PaperPlacement As PaperPlacementType
	Get
	Set
```
```cpp
public:
property PaperPlacementType PaperPlacement {
	PaperPlacementType get ();
	void set (PaperPlacementType value);
}
```
```fsharp
member PaperPlacement : PaperPlacementType with get, set
```

#### Property Value

PaperPlacementType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Thrown when the input argument is out of range. |

#### Reference

PrintParameters Class

Autodesk.Revit.DB Namespace